In [55]:
# Import dependencies
import pandas as pd
import numpy as np

### Objective: separate data source into tables for normalization prior to import in pgAdmin4

In [45]:
# Import data
df = pd.read_csv(
    'Resources/wfp_food_prices_database.csv', 
    dtype={
    'adm0_id': int, 
    'adm0_name': 'string', 
    'adm1_id': int, 
    'adm1_name': 'string', 
    'mkt_id': int, 
    'mkt_name': 'string',
    'cm_id':int,
    'cm_name':'string',
    'cur_id':int,
    'cur_name':'string',
    'pt_id':int,
    'pt_name':'string',
    'um_id':int,
    'um_name':'string',
    'mp_month':int,
    'mp_year':int,
    'mp_price':float,
    'mp_commoditysource':'string'
    })

In [46]:
df.head()

,adm0_id,adm0_name,adm1_id,adm1_name,mkt_id,mkt_name,cm_id,cm_name,cur_id,cur_name,pt_id,pt_name,um_id,um_name,mp_month,mp_year,mp_price,mp_commoditysource
0,1,Afghanistan,272,Badakhshan,266,Fayzabad,55,Bread - Retail,0,AFN,15,Retail,5,KG,1,2014,50.0,<NA>
1,1,Afghanistan,272,Badakhshan,266,Fayzabad,55,Bread - Retail,0,AFN,15,Retail,5,KG,2,2014,50.0,<NA>
2,1,Afghanistan,272,Badakhshan,266,Fayzabad,55,Bread - Retail,0,AFN,15,Retail,5,KG,3,2014,50.0,<NA>
3,1,Afghanistan,272,Badakhshan,266,Fayzabad,55,Bread - Retail,0,AFN,15,Retail,5,KG,4,2014,50.0,<NA>
4,1,Afghanistan,272,Badakhshan,266,Fayzabad,55,Bread - Retail,0,AFN,15,Retail,5,KG,5,2014,50.0,<NA>

In [47]:
df.columns

Index(['adm0_id', 'adm0_name', 'adm1_id', 'adm1_name', 'mkt_id', 'mkt_name',
       'cm_id', 'cm_name', 'cur_id', 'cur_name', 'pt_id', 'pt_name', 'um_id',
       'um_name', 'mp_month', 'mp_year', 'mp_price', 'mp_commoditysource'],
      dtype='object')

In [48]:
# Create the country ID table
country_df = df.drop(['adm1_id', 'adm1_name', 'mkt_id', 'mkt_name',
                     'cm_id', 'cm_name', 'cur_id', 'cur_name', 'pt_id', 'pt_name', 'um_id',
                     'um_name', 'mp_month', 'mp_year', 'mp_price', 'mp_commoditysource'], axis=1)
country_df.head()

   adm0_id    adm0_name
0        1  Afghanistan
1        1  Afghanistan
2        1  Afghanistan
3        1  Afghanistan
4        1  Afghanistan

In [49]:
country_names = list(country_df['adm0_name'].unique())
country_names

country_id = list(country_df['adm0_id'].unique())

country_names_unique_df = pd.DataFrame(
    data={
        'adm0_id': list(country_df['adm0_id'].unique()),
        'adm0_name': list(country_df['adm0_name'].unique())
    }
)

# Check to see if df has been created correctly
country_names_unique_df.loc[country_names_unique_df['adm0_name'] == 'Sudan']

    adm0_id adm0_name
83    40764     Sudan

In [70]:
# Create locality_id table
locality_df = df.drop(['adm0_id', 'adm0_name', 'mkt_id', 'mkt_name',
                       'cm_id', 'cm_name', 'cur_id', 'cur_name', 'pt_id', 'pt_name', 'um_id',
                       'um_name', 'mp_month', 'mp_year', 'mp_price', 'mp_commoditysource'], axis=1)

locality_df.head()

locality_df['adm1_name'].unique()

<StringArray>
[         'Badakhshan',             'Badghis',             'Baghlan',
               'Balkh',              'Bamyan',               'Farah',
              'Faryab',              'Ghazni',                'Ghor',
             'Hilmand',
 ...
            'Bulawayo',              'Harare',          'Manicaland',
 'Mashonaland Central',    'Mashonaland East',    'Mashonaland West',
            'Masvingo',  'Matabeleland North',  'Matabeleland South',
            'Midlands']
Length: 614, dtype: string

In [ ]:
locality_df.

In [ ]:
# Create a table of unique localities

locality_names_unique_df = pd.DataFrame(
    data={
        'adm1_id':list(locality_df['adm1_id'].unique()),
        'adm1_name':list(locality_df['adm1_name'].unique())
    }
)